app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "uyt"], ["author", ""], ["created_at", "2018-11-07 15:57:04.938107"], ["updated_at", "2018-11-07 15:57:04.938107"]]
---
  def create
    @message = Message.new(message_params)
    if @message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "messages" SET "content" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["content", "y"], ["updated_at", "2018-11-07 16:26:02.410057"], ["id", 5]]
---
  def update
    @message = Message.find(params[:id])
    if @message.update(message_params)